############################################################################# 1 вопрос

name = "Умар"

age = 14

print(f"Привет, меня зовут {name} и мне {age} лет.")
########################################################################## 2 вопрос

number1 = 10
number2 = 5

print(f"Сумма: {number1 + number2}")

print(f"Разность: {number1 - number2}")

print(f"Произведение: {number1 * number2}")

print(f"Частное: {number1 / number2}")

# print(f"Вычисление степени: {number1 ** number2}")
############################################################################## 3 вопрос

number3 = 7.5

number4 = 2

print(f"Целая часть и остаток: {number3 / number4}")
############################################################################## 4 вопрос

r = 5

pi = 3.14

print(f"Длинна круга: {2 * pi * r}")

print(f"Площадь круга: { pi * (r ** 2)}")
########################################################################### 5 вопрос

print(f"Вычисление квадрата: {number2 ** 2}")
print(f"Вычисление куба: {number2 ** 3}")

